// Дано число. Проверить кратно ли оно 7 и 23
    System.Console.Write("Введите число: ");
    int a=Convert.ToInt32(Console.ReadLine());
    if (a%7==0 && a%23==0) System.Console.Write("Число кратно и 7 и 23");
    else System.Console.Write("Число не кратно 7 и 23");
