// Вывести на экран четные числа от 1 до N
Console.WriteLine("Hello, World!");
int i=2;
int N=10;
while(i<=N){
    System.Console.WriteLine(i);
    i=i+2;
}
